In [1]:
import pandas as pd,numpy as np
df = pd.read_csv('C:/Users/samuel/Documents/Data Science Jobs Salaries.csv')

In [2]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021e,EN,FT,Data Science Consultant,54000,EUR,64369,DE,50,DE,L
1,2020,SE,FT,Data Scientist,60000,EUR,68428,GR,100,US,L
2,2021e,EX,FT,Head of Data Science,85000,USD,85000,RU,0,RU,M
3,2021e,EX,FT,Head of Data,230000,USD,230000,RU,50,RU,L
4,2021e,EN,FT,Machine Learning Engineer,125000,USD,125000,US,100,US,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           245 non-null    object
 1   experience_level    245 non-null    object
 2   employment_type     245 non-null    object
 3   job_title           245 non-null    object
 4   salary              245 non-null    int64
 5   salary_currency     245 non-null    object
 6   salary_in_usd       245 non-null    int64
 7   employee_residence  245 non-null    object
 8   remote_ratio        245 non-null    int64
 9   company_location    245 non-null    object
 10  company_size        245 non-null    object
dtypes: int64(3), object(8)
memory usage: 21.2+ KB

Fortunately for us, there are no missing values in the dataset, so we need not  worry about data imputation

In [5]:
from pandas_profiling import ProfileReport
profile = ProfileReport(df=f,title="Data science jobs report")
profile.to_file(output_file="ds_jobs_report.html")

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

### Inferences from the data exploration

1. The data was collected just over the course of two years. i.e just 2020 and 2021 tech salaries in data science

2. The majority of the samples are people of medium level experience(MI) and executive level(EX) are the lowest in number

3. over 94% of the samples here work fulltime roles.

4. The data scientist job title is the most common .

5. The median salary is $81k

In [6]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [7]:
df.drop_duplicates(inplace=True)

In [8]:
df.shape

(244, 11)

In [9]:
cat_cols = df.columns.difference(['remote_ratio','salary_in_usd','salary'])

In [10]:
cat_cols

Index(['company_location', 'company_size', 'employee_residence',
       'employment_type', 'experience_level', 'job_title', 'salary_currency',
       'work_year'],
      dtype='object')

Label Encoding for all columns

In [11]:
for i in cat_cols:
    df[i] = df[i].astype('category')
    df[i] = df[i].cat.codes

In [12]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,1,0,2,17,54000,5,64369,9,50,10,0
1,0,3,2,20,60000,5,68428,14,100,39,0
2,1,1,2,27,85000,14,85000,38,0,34,1
3,1,1,2,26,230000,14,230000,38,50,34,0
4,1,0,2,32,125000,14,125000,43,100,39,2

Performing one hot encoding on columns with low cardinality

In [16]:
for i in cat_cols:
    print(i , df[i].nunique())

company_location 41
company_size 3
employee_residence 45
employment_type 4
experience_level 4
job_title 43
salary_currency 15
work_year 2

In [17]:
df = pd.get_dummies(df, columns=['company_size', 'work_year', 'employment_type','experience_level' ])

In [18]:
df.head()

,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size_0,company_size_1,company_size_2,work_year_0,work_year_1,employment_type_0,employment_type_1,employment_type_2,employment_type_3,experience_level_0,experience_level_1,experience_level_2,experience_level_3
0,17,54000,5,64369,9,50,10,1,0,0,0,1,0,0,1,0,1,0,0,0
1,20,60000,5,68428,14,100,39,1,0,0,1,0,0,0,1,0,0,0,0,1
2,27,85000,14,85000,38,0,34,0,1,0,0,1,0,0,1,0,0,1,0,0
3,26,230000,14,230000,38,50,34,1,0,0,0,1,0,0,1,0,0,1,0,0
4,32,125000,14,125000,43,100,39,0,0,1,0,1,0,0,1,0,1,0,0,0

In [19]:
from sklearn.model_selection import train_test_split
from sklearn import ensemble
from sklearn import metrics

In [20]:
X = df.drop('salary_in_usd', axis = 1)
y = df['salary_in_usd']

In [21]:
X_train,X_test,y_train,y_test = train_test_split(X,y,random_state=0,test_size=.25)

In [31]:
model = ensemble.GradientBoostingRegressor()
model.fit(X_train,y_train)
preds = model.predict(X_test)

In [32]:
metrics.mean_squared_error(y_test,preds,squared=False) #rmse

16337.10077385093

**Next Task**
Building a Pipeline that wraps all the steps from the preprocessing down to getting a prediction from our model